Revit 2027 API
RebarReinforcementData.RebarId Property
 The id of the Rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RebarId { get; set; }
Public Property RebarId As ElementId
	Get
	Set
public:
property ElementId^ RebarId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RebarId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace